app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores`
---
  def index
    search = params[:search] unless params[:search].nil?
    @stores = Store.search(search)

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @store = Store.find(params[:id])

INSERT INTO `stores` (`city`, `created_at`, `latitude`, `longitude`, `name`, `state`, `street`, `tenant_id`, `updated_at`, `zip`) VALUES ('Hannover', '2013-09-11 07:57:29', 52.40094999999999, 9.7766, 'Teststore', '', 'Immermannstrasse 1', 2, '2013-09-11 07:57:29', '30177')
---
  def create
    @store = Store.new(params[:store])
    @store.tenant = Tenant.current

    respond_to do |format|
      if @store.save

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "stores" SET "street" = 'Ferdinand-Wallbrecht-Str. 16', "longitude" = 9.748973, "latitude" = 52.3905232, "updated_at" = '2013-06-11 15:49:43.608886' WHERE "stores"."id" = 4
---
  def update
    @store = Store.find(params[:id])

    respond_to do |format|
      if @store.update_attributes(params[:store])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 4]]
---
  def destroy
    @store = Store.find(params[:id])
    @store.destroy